[{"model": "blog.post", "pk": 3, "fields": {"title": "Gear Ratio", "content": "Choosing the Right Fixed Gear Cog for Your Commute\r\n\r\nWhen it comes to riding a fixed gear bike, few components influence your ride as much as the cog. That small piece of steel on your rear hub determines how easy (or hard) it’ll be to spin through city traffic, cruise on the flats, or grind up a steep hill. Whether you’re commuting daily or just enjoying weekend rides, picking the right fixed gear cog size can make all the difference in comfort and efficiency.\r\n\r\nWhat Is a Fixed Gear Cog?\r\n\r\nA fixed gear cog is the rear gear that threads directly onto your hub. Unlike a freewheel, it doesn’t let you coast—your pedals always move with your wheel. This direct connection is what gives fixed gear bikes their smooth, responsive feel and minimalist charm.\r\n\r\nCogs come in a range of sizes, usually between 12 and 20 teeth, and the number of teeth affects how your bike rides.\r\n\r\nSmaller cogs (12–14T) = Harder to pedal, faster top speed.\r\n\r\nLarger cogs (16–20T) = Easier to pedal, slower top speed.\r\n\r\nThe trick is finding the right balance for your commute.\r\n\r\nGearing Ratios: Finding Your Sweet Spot\r\n\r\nYour gear ratio is determined by dividing your chainring size (up front) by your cog size (in the back). For example, if you’re running a 48-tooth chainring with a 16-tooth cog, your ratio is 3:1. That means for every pedal rotation, your wheel spins three times.\r\n\r\nFor Flat City Streets\r\n\r\nIf your commute is mostly flat—think downtown grids or long, open boulevards—a 15T or 16T cog paired with a 48T chainring is a solid choice. It gives you enough speed for quick sprints between lights without wearing out your legs.\r\n\r\nFor Rolling Terrain\r\n\r\nIf your route includes a few mild hills, consider stepping up to a 17T cog. It slightly reduces your top-end speed but makes climbing smoother and helps you maintain control when descending.\r\n\r\nFor Hilly Commutes\r\n\r\nIf you live in a city with real elevation changes—San Francisco, Seattle, or Pittsburgh, for example—a 18T or 19T cog can save your knees. The lower gearing makes grinding up hills more manageable, especially if you’re riding brakeless or carrying a backpack.\r\n\r\nReal-World Cog Setups\r\n\r\nHere are a few common setups riders swear by:\r\n\r\n48×15 – Fast, aggressive, great for strong riders on flat routes.\r\n\r\n46×16 – The classic all-around commuter setup; comfortable yet quick.\r\n\r\n44×18 – Perfect for hilly terrain or longer rides where endurance matters more than speed.\r\n\r\nRemember, every rider’s style and route are different—so don’t be afraid to experiment.\r\n\r\nMaterials and Quality Matter\r\n\r\nMost track and fixed gear cogs are made from hardened steel, known for durability and clean engagement. Brands like Shimano, Dura-Ace, and Izumi offer long-lasting options that can handle daily commuting abuse. A well-machined cog paired with a quality lockring ensures smooth power transfer and fewer skipped teeth.\r\n\r\nFinal Thoughts\r\n\r\nThe right fixed gear cog transforms how your bike feels under you. Whether you’re spinning through rush-hour traffic or climbing your way home, a few teeth can completely change your ride.\r\n\r\nIf your commute has more hills than flats, lean toward a larger cog. If it’s pancake-flat and you want to fly, go smaller. Take the time to find your gear ratio sweet spot—it’s part of the fun of riding fixed.", "published": "2025-10-14T22:30:59.764Z", "author": "Evan Krupa", "image": "static/images/shimano_1hnhLaT.jpeg"}}, {"model": "blog.post", "pk": 4, "fields": {"title": "Why I Ride Fixed Gear- And Why You Might Want To, Too", "content": "If you’ve ever ridden a fixed gear bike, you know there’s something different about it. The simplicity, the rhythm, the connection between rider and machine—it’s pure, direct, and addicting. I’ve been riding and commuting on fixed gear bikes for over 10 years now, and I can honestly say I’ve never looked back.\r\n\r\nI grew up racing mountain bikes and spending hours on trails, learning how to handle technical climbs and fast descents. But when I started road riding, I found it… boring. There was something missing—the excitement, the feedback, the challenge. That’s when I discovered fixed gear riding, and everything changed.\r\n\r\nWith a fixed gear, you’re always engaged. There’s no coasting. Every pedal stroke matters, and you feel completely in tune with the bike and the road. You use your legs not just for power, but for control. It turns a simple ride into a dance of balance and precision.\r\n\r\nThese days, my main ride is my Surly Steamroller, a bike that’s been with me through city commutes, long rides, and everything in between. I’ve been commuting by bike for about six years now—sometimes doing up to 28 miles a day—and I’ve learned a lot about what makes commuting efficient, safe, and genuinely enjoyable.\r\n\r\nThat’s why I started this blog:\r\nTo share what I’ve learned about fixed gear riding and daily bike commuting. Whether you’re curious about trying fixed gear for the first time, or looking to refine your setup for a smoother commute, this space will cover it all—gear recommendations, bike setups, commuting tips, and how to make biking an everyday habit that actually sticks.\r\n\r\nRiding fixed gear has made every mile more fun, every route more engaging, and every day a little better. I hope this blog inspires you to hop on your bike, try something new, and find that same joy in the ride.\r\n\r\nWelcome to the journey—let’s ride.", "published": "2025-10-18T11:33:44.633Z", "author": "Evan Krupa", "image": "static/images/whyiride_zj4XLGz.png"}}, {"model": "blog.post", "pk": 5, "fields": {"title": "Best Fixed Gear Under $500", "content": "Finding Your First Fixed Gear: Where to Start\r\n\r\nIf you’re looking for your first fixed gear bike and don’t know where to start—take a deep breath, you’ve come to the right place. I’ve owned a handful of fixed gear bikes over the years (some better than others), and I’ve learned what to look for—and what to avoid—when picking a beginner-friendly setup.\r\n\r\nFrom components to ride quality, there are a few details that can make a difference. That said, if you’re just getting into fixed gear riding, don’t stress over every spec sheet. Unless you’re already logging miles on a geared bike, some of those technical details won’t mean much right away—and that’s perfectly fine.\r\n\r\nThe Frame: Why Steel Is Still Real\r\n\r\nLet’s start with the backbone of every bike—the frame. And yes, steel is real. Most entry-level fixed gears are built with steel frames, and for good reason. Steel is strong, durable, and surprisingly forgiving. It might weigh a little more than aluminum, but it also softens the blow of potholes and speed bumps—something your spine will thank you for later.\r\n\r\nMost budget-friendly fixies use high-tensile steel, which is perfectly fine to start with. It gets you rolling without breaking the bank. The ride might feel a little muted or “dead,” but once you upgrade to a 4130 chromoly frame or better, you’ll instantly notice the difference—a livelier, more connected feel that makes every pedal stroke more rewarding.\r\n\r\nA Solid Starter: Golden Cycles Fixed Gear\r\n\r\nIf you’re working with a sub-$500 budget, one bike that consistently punches above its weight is the Golden Cycles Fixed Gear\r\n. It’s simple, sturdy, and stylish—everything you want in your first fixie. The steel frame paired with aluminum deep-dish wheels offers a solid, confidence-boosting ride.\r\n\r\nSure, those deep rims add a touch of extra weight, but they also make the bike feel planted and stable when you’re cruising through city streets. For the price, it’s a fantastic entry point into the world of fixed gear cycling—and a great way to see what all the fuss is about.", "published": "2025-11-03T02:04:24.599Z", "author": "Evan Krupa", "image": "static/images/bestfixed3.png"}}, {"model": "blog.post", "pk": 6, "fields": {"title": "Best Bike Locking Method for Urban Riders in 2025", "content": "Best Bike Locking Method for Urban Riders in 2025\r\n\r\nUrban bike commuting continues to grow in 2025, and with more riders on the road, bike security has become more important than ever. Whether you're locking up outside a coffee shop for a few minutes or leaving your bike at work all day, the right locking method can make a huge difference in preventing theft. After years of riding fixed gear in the city, here’s the locking setup I trust and recommend for any commuter.\r\n\r\n1. The U-Lock + Rear Wheel Method (Still the Gold Standard)\r\n\r\nIf you only invest in one lock, make it a solid U-lock. Locking the frame and rear wheel together against a secure pole or rack is one of the safest and most reliable methods for city riders.\r\n\r\nWhy the rear wheel?\r\nThe back wheel is more expensive to replace and harder for thieves to remove. By securing both the rim and the frame inside the U-lock, you make your bike a much less appealing target.\r\n\r\nSteps:\r\n\r\nPlace the U-lock around the rear wheel inside the rear triangle of the frame.\r\n\r\nMake sure the lock also wraps around the rack or pole.\r\n\r\nKeep the lock high and tight to limit leverage points.\r\n\r\nThis method protects your most valuable wheel while ensuring the frame stays secure.\r\n\r\n2. Add a Cable to Securing the Front Wheel\r\n\r\nA U-lock alone protects your frame and rear wheel, but a cable adds an extra layer of security by looping through the front wheel. It’s lightweight and easy to carry, and while it won’t stop heavy-duty thieves, it’s a great deterrent for quick grab-and-go attempts.\r\n\r\nTo use the cable effectively:\r\n\r\nRun it through the front wheel.\r\n\r\nLoop it through the U-lock shackle before closing it.\r\n\r\nThis makes sure both wheels and the frame are locked up without needing two bulky locks.\r\n\r\n3. Avoid Quick-Release Wheel Hubs\r\n\r\nQuick-release skewers might be convenient, but they’re also one of the fastest ways for thieves to walk away with your wheels. In a dense urban area, quick-release hardware is basically an invitation for someone to help themselves.\r\n\r\nIf you’re commuting daily, swapping these out is a must.\r\n\r\n4. Use Allen-Key Bolts or Security Hardware\r\n\r\nTo prevent wheel theft on my own fixed gear, I use standard allen-key bolts instead of quick-release hubs. This simple change makes it much harder for someone to remove your wheels without tools.\r\n\r\nWhy it works:\r\n\r\nMost opportunistic thieves don’t carry full toolkits.\r\n\r\nAllen bolts take longer to loosen, which makes thieves more likely to move on.\r\n\r\nThey’re affordable, lightweight, and don’t require constant adjustment.\r\n\r\nFor even more security, some riders upgrade to proprietary locking bolts, but even regular allen-key hardware is a strong improvement over quick-release.\r\n\r\n5. Final Tips for Locking Up in the City\r\n\r\nTo stay as safe as possible in 2025’s urban environments:\r\n\r\nLock to solid, immovable objects that are bolted down.\r\n\r\nKeep your lock off the ground to avoid leverage attacks.\r\n\r\nLock in well-lit, high-traffic areas.\r\n\r\nAlways take accessories like lights or bags with you.\r\n\r\nBike theft isn't going anywhere, but with the right method—and a little awareness—you can make your fixed gear a lot less appealing to whoever is hunting for an easy target.", "published": "2025-11-17T15:00:36.832Z", "author": "Evan Krupa", "image": "static/images/bikelock.jpg"}}, {"model": "blog.gear", "pk": 1, "fields": {"name": "Basin 18", "brand": "The North Face", "description": "Of all the backpacks I’ve tested for bike commuting, this one easily tops the list. Originally designed for hiking, its 18-liter capacity strikes the perfect balance between compact and spacious—enough room for a change of clothes, bike tools, and a few last-minute extras. The breathable mesh back panel and nicely padded, vented shoulder straps keep things cool and comfortable, even on longer rides. Plus, the built-in rain cover has saved me more than once from unexpected downpours. Lightweight, functional, and thoughtfully designed, it’s become my go-to commuting pack.", "image": "static/images/Basin-18-Backpack.jpeg", "link": "https://amzn.to/43m0C9T"}}, {"model": "blog.gear", "pk": 2, "fields": {"name": "Yalta 2.0", "brand": "Chrome Industries", "description": "A true workhorse. I’ve used this heavy-duty, high-capacity bag since 2015, and it continues to handle rain, wind, and daily commutes without complaint. Plenty of room for extra layers or rain gear—simple, durable, and built for the long haul.\r\n\r\nSpecs:\r\n- 30 L\r\n- Weatherproof\r\n- Laptop sleep on the side", "image": "static/images/yalta.jpg", "link": "http://www.chromeindustries.com"}}, {"model": "blog.gear", "pk": 3, "fields": {"name": "Jack The Bike Rack", "brand": "Whole Grain Cycles", "description": "Jack the Bike Rack is one of those rare upgrades that instantly makes fixed-gear commuting easier without ruining your bike’s clean lines. It mounts securely to your handlebars in minutes—no tools, no permanent hardware—and holds a surprising amount of weight for such a minimal setup. Perfect for carrying a backpack, groceries, or a light load on your daily ride, it keeps the bike balanced and agile. For anyone riding fixed and wanting utility without bulk, Jack is as practical as it is sleek.", "image": "static/images/jackrack.jpeg", "link": "https://amzn.to/4o8tlGN"}}, {"model": "blog.gear", "pk": 4, "fields": {"name": "Track Cog", "brand": "Shimano", "description": "A classic piece of reliable engineering, the Shimano Track Cog is built for riders who value precision and durability. Machined from hardened steel, this cog delivers smooth, consistent engagement mile after mile—perfect for both velodrome use and everyday fixed-gear commuting", "image": "static/images/shimano.jpeg", "link": "https://amzn.to/3LVyR1J"}}, {"model": "blog.gear", "pk": 5, "fields": {"name": "Swift 450 Lumen Font Bike Light", "brand": "Nite Rider", "description": "The NiteRider Swift 450 is a compact, reliable front light perfect for bike commuting. With 450 lumens, it gives you plenty of visibility whether you're riding after dark or just want to stand out in traffic. It features multiple light modes, a secure tool-free mount, and a convenient USB-rechargeable design. Lightweight, durable, and bright—an easy choice for everyday commuters who want to be seen and stay safe.", "image": "static/images/niterider.png", "link": "https://amzn.to/4qVPyuh"}}, {"model": "blog.gear", "pk": 6, "fields": {"name": "VMAX+ 150 Lumen Tail Light", "brand": "Nite RIder", "description": "The NiteRider Vmax+ 150 is a high-visibility rear bike light built to keep you seen from a distance on every ride. With a bright 150-lumen output and wide-angle visibility, it ensures drivers notice you whether you’re commuting, cruising, or riding at dusk. The lightweight design features multiple flash modes, a long-lasting USB-rechargeable battery, and a secure seatpost mount that stays put on rough roads. Simple, bright, and dependable—an excellent choice for boosting your visibility and safety on the bike.", "image": "static/images/Screenshot_2025-11-14_at_8.13.37AM.png", "link": "https://amzn.to/47MwvcM"}}, {"model": "blog.gear", "pk": 7, "fields": {"name": "Evolution Mini-7 Bike Lock", "brand": "Kryptonite", "description": "The Kryptonite Evolution Mini-7 is a compact, high-security U-lock designed for urban riders who need reliable protection without extra bulk. Its hardened steel shackle resists bolt cutters and leverage attacks, while the included 4-foot cable adds flexibility for securing your front wheel or accessories. With a durable, pick-resistant disc-style cylinder and a versatile size that fits most bike frames, the Mini-7 is a trusted choice for daily commuters and fixed gear riders looking for strong, lightweight security.", "image": "static/images/lockamazon.jpg", "link": "https://amzn.to/47KRz4L"}}, {"model": "blog.contactmessage", "pk": 1, "fields": {"name": "Evan", "email": "evan@me.com", "message": "Hey this is a test to see if this works", "sent_at": "2025-10-26T20:45:03.063Z"}}, {"model": "blog.bike", "pk": 1, "fields": {"model": "Steamroller", "brand": "Surly", "description": "Surly Steamrolller with Nitto drop bars", "image": "static/images/922386A5-EB99-41E3-8697-5CCC51A25D1D.jpeg", "link": null}}, {"model": "blog.bike", "pk": 2, "fields": {"model": "Steamroller", "brand": "Surly", "description": "Surly Steamroller", "image": "static/images/21793794-90F2-4E1B-BF4A-163EADD2BEBF.jpeg", "link": null}}, {"model": "blog.bike", "pk": 3, "fields": {"model": "Steamroller", "brand": "Surly", "description": "Steamroller out in the wilderness", "image": "static/images/A554037A-AE5B-4DCF-A3B3-8606CF935D91.jpeg", "link": null}}]